{"meta":{"title":"Zecx","subtitle":"","description":"","author":"Zecx","url":"http://example.com","root":"/"},"pages":[{"title":"Tags","date":"2022-04-30T10:10:22.000Z","updated":"2022-04-30T10:10:37.402Z","comments":true,"path":"tags/index.html","permalink":"http://example.com/tags/index.html","excerpt":"","text":""},{"title":"categories","date":"2022-04-30T10:14:05.000Z","updated":"2022-04-30T10:14:35.652Z","comments":true,"path":"categories/index.html","permalink":"http://example.com/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"怎样的动作游戏玩起来“爽”——从《崩坏3》说起","slug":"bh3action","date":"2021-10-17T08:36:42.000Z","updated":"2021-10-19T15:43:42.017Z","comments":true,"path":"2021/10/17/bh3action/","link":"","permalink":"http://example.com/2021/10/17/bh3action/","excerpt":"怎样的动作游戏玩起来“爽”——从《崩坏3》说起在一般的认知里，动作游戏具有战斗爽快、演出华丽、紧张刺激等特点。但随之而来的是操作复杂、出招表冗长、难以上手，因此让不少玩家望而却步。《崩坏3》作为一款动作类的手游（支持全平台），在目标客户群收获了惊人的成绩，一度月流水突破2亿。它不是第一款移动平台的动作手游，但是用属于自己的方式赢得了玩家的喜爱。本文将以《崩坏3》游戏的基础角色“琪亚娜”出发，通过第一章关卡的内容，从游戏系统的运动和战斗等两个角度切入，试分析《崩坏3》为何能成为一款低门槛的动作爽游。","text":"怎样的动作游戏玩起来“爽”——从《崩坏3》说起在一般的认知里，动作游戏具有战斗爽快、演出华丽、紧张刺激等特点。但随之而来的是操作复杂、出招表冗长、难以上手，因此让不少玩家望而却步。《崩坏3》作为一款动作类的手游（支持全平台），在目标客户群收获了惊人的成绩，一度月流水突破2亿。它不是第一款移动平台的动作手游，但是用属于自己的方式赢得了玩家的喜爱。本文将以《崩坏3》游戏的基础角色“琪亚娜”出发，通过第一章关卡的内容，从游戏系统的运动和战斗等两个角度切入，试分析《崩坏3》为何能成为一款低门槛的动作爽游。 测试数据提示本文章测试时按《崩坏3》稳定60fps计算，人物动作的帧数由于计算性能限制可能会有上下少许误差。由于动作速度过快，文中动图大部分为游戏原画面放慢5倍后的效果。 运动谈论动作游戏自然无法脱离人物的移动操作。在《崩坏3中》玩家可执行的移动类操作主要包括奔跑、转身与回避，这三者的设计都体现了一个词——速度感。 奔跑琪亚娜的奔跑动作一共分3个阶段，分别是启动加速、高速奔跑、减速停止(刹车)。在启动阶段，她从静止开始到的动作只维持4帧，约等于0.06秒，远低于人类的一般反应速度0.2-0.4秒。所以在操作人物进入跑步时几乎感受不到琪亚娜的起步加速过程，非常敏捷。作为对比，3D超级马里奥中主角的起步加速阶段持续了9帧，给人的直观感受就是马里奥身形较为笨重，符合他的人设形象。 图1 琪亚娜静止启动 图2 马里奥静止启动 在进入高速奔跑阶段后，如果停止按键，琪亚娜将开始减速停止。她会将当前奔跑的支撑脚固定后，用另一条腿作一个刹车动作。尽管整个过程会持续36帧，但从约第10帧开始琪亚娜是位置就不发生任何变化了。后续的动作更多是为了显得刹车的惯性符合人类直觉。而更重要的是在琪亚娜减速的过程中，如果玩家重新按下移动键，将会使她跳过启动加速的动作片段，直接进入高速奔跑的状态，提高了玩家对角色的移动可控性，并营造了琪亚娜这个角色迅捷的特点。即使关卡设计要求角色间歇移动，玩家也不会因为反复的减速-加速过程而感到琪亚娜的动作有任何停滞。 图3 奔跑接刹车 ![图4 刹车接奔跑](/images/bh3action/bh3action_图4刹车接奔跑.gif) 图4 刹车接奔跑 此外值得一提的是，《崩坏3》中的摄像机并不是背随视角，角色的横向移动会随着视点作圆周运动。而关卡环境的外围设有较大面积的空气墙，玩家在碰撞空气墙时会沿着墙体滑行。这使得哪怕玩家胡乱操作，也无法被地图的任何死角卡住而不能移动。这一方面保证了玩家在移动时去不了不符合游戏设计者意图的目的地，另一方面塑造了一种“只要玩家在操作，角色就可以一直动下去”的气氛，增强了游戏的动感。 图5 角色绕视点转圈 ![图6 地图边缘空气墙](/images/bh3action/bh3action_图6地图边缘空气墙.gif) 图6 地图边缘空气墙 ![图7 角色单向移动脱离死角](/images/bh3action/bh3action_图7角色单向移动脱离死角.gif) 图7 角色单向移动脱离死角 转身在清版类动作游戏中，四周连续出现的敌人要求玩家时常需要转身。《崩坏3》中的转身设计也以速度为核心，做到能快则快。 在琪亚娜静止状态时按下与当前她面朝方向相反的方向，她将开始一次180°的转身。令人惊讶的是，这一次转身只占用4帧，与启动加速的时长完全一样。并且在转身结束后琪亚娜将直接进入高速奔跑状态，这意味着原地启动时，琪亚娜的转身没有任何代价——她不会因为多转一次方向而延缓动作导致挨打。 图8 静止转身 当琪亚娜在奔跑的过程中转身时，将消耗8帧的时长来完成180°的转弯。尽管这和静止状态下的转身时长相比长了一倍，但是0.13秒的时长仍属迅速。且这8帧的前后4帧平均地实现了角色的两次直角转弯，动作显得十分流畅。与2D游戏角色可以瞬时转向不同，如果要求3D角色进一步缩短动作时长，转向的动作很难保证平滑顺畅，容易因小失大。 图9 奔跑中转身 如果琪亚娜在刹车动作进行了转身操作，琪亚娜将会取消漫长的刹车后摇，直接进行只与静止转身一样的4帧转身动作，速度快到难以捕捉。 图10 刹车中转身 回避动作游戏少不了回避动作。《崩坏3》中琪亚娜的回避会根据玩家输入方向进行一次空翻，而这一空翻把琪亚娜的速度感又提升了一个台阶。空翻的时长为22帧。该动作即使通过逐帧动画也无法看出明显的前摇，可以说做到了即按即翻。 图11 静止状态下回避 可以看到在动作结束后，琪亚娜会做一个与奔跑结束时一样的收腿动作以缓冲空翻的惯性，尽管这一动作超过30帧，但是可以被移动、攻击取消。甚至根据角色不同，玩家还可以实现2连、3连回避。 图12 奔跑中回避接奔跑没有任何停滞 图13 二连回避 不论是接续移动、回避还是攻击，回避的后摇都会在不引入额外接续动作前摇的前提下被瞬间取消，玩家按键的操作反馈延时极低。 图14 回避后出招取消回避后摇 可以看到回避后出招与直接出招的动作是完全一样的，并没有引入冗余动作。 图15 直接出招 小结不需0.1秒即可进入奔跑状态；减速加速、转身没有实质惯性缓冲；转身、回避几乎没有任何前摇；回避与刹车后摇可以被其他移动完全取消，如果不取消则可以欣赏富有角色特色的肢体动作……概括起来也就是 超快的动作速度 动作无效时间占比少 自由的动作接续规则 动作设计富有美感这样的设计塑造了一个操作跟手，按键反馈即按即有，动作干净利落又迅速、速度感十足的游戏角色。 战斗战斗自然是动作游戏设计的重中之重。在《崩坏3》中如果不考虑特殊技能，角色的攻击键其实只有一个。从琪亚娜的普通攻击连招切入，可以看出《崩坏3》的确意在为玩家打造爽快的战斗体验。再考虑到敌人的战斗交互，设计的核心呼之欲出——简单。 玩家招式琪亚娜的普通攻击连招分两种类型，一种为连续按下攻击键，在不间断按键的前提下，琪亚娜会使出一套6连击的combo。 图16 琪亚娜连续攻击combo 如果在combo中加入停顿，则会降低攻击的频率，但使出更强力的combo。也就是时间（更容易挨打）换输出。 图17 琪亚娜停顿攻击combo 琪亚娜攻击动作的前摇普遍偏长，以她的攻击第一招突进脚踢为例，前冲突进加上抬腿一共持续约21帧，代表攻击判定生效的电光特效从第22帧才开始出现，在持续8帧之后就消失，相比动作的前摇非常短。这样的帧数分配使的琪亚娜出招的力量感十足，每一拳每一脚都有“铆足了劲用力打”的感觉，而在每一次攻击特效头2帧附带的明显振屏特效更是强化了这一点。 这一设计给角色带来的弱点就是前摇过长容易挨打。但是《崩坏3》对此提出了补偿机制：前摇在任何时刻可以通过回避取消。这样的机制拓宽了玩家的操作空间，提高了容错率——玩家可以通过回避来“反悔”自己误开始的攻击。这在降低游戏难度的同时也给玩家在高难度下提供了更大的生存空间。与此形成对比的是以“硬核”著称的《怪物猎人》、《只狼》等游戏，玩家即便在攻击动作中按下了回避按键，回避动作也只会在攻击动作结束后发生，增加了玩家在面对强敌时的操作风险。 图18 琪亚娜出招转回避取消出招 ![图19 怪猎出招接回避无法取消动作](/images/bh3action/bh3action_图19怪猎出招接回避.gif) 图19 怪猎出招接回避无法取消动作 此外，琪亚娜的攻击前摇还附带了霸体效果（不被敌方攻击打断），使她在面对敌人时无脑攻击也可以过关。玩家可以在灵巧游击和硬碰硬等不同的风格中根据自己的喜好来操作角色，不仅丰富了玩家的选择，更大大降低了游戏难度。 图20 出招自带霸体 AI设计在第一章的关卡中，敌人的攻击频率非常低，哪怕玩家持续站着不动，敌人也不会连续发起攻击，对玩家的威胁很小。 图21 较低的AI出招频率(该图为原速) 同时敌人的招式大多带有明显的提示，不论是近战、远程还是范围攻击，在攻击前会给出醒目的辅助预判特效。 图22 敌人近战攻击预判特效 图23 敌人远程攻击预判特效 图24 敌人范围攻击预判特效 值得注意的是，这些特效除了醒目之外，还有一个特点——慢。以敌人的近战攻击为例，从紫色的特效开始到攻击命中玩家产生伤害数字一直经过了33帧，相当于0.55秒，远低于一般人的反应速度，在动作游戏中属于对反应要求很低的玩家考验：《猎天使魔女》、《鬼泣》等游戏留给玩家的反应时间大多在0.2到0.4秒之间，更不要说这些游戏并不会有明显的粒子特效来提示敌人即将发起攻击。 敌我互动基于以上的角色与敌人设计，可能的敌我互动可以有无数种。但是《崩坏3》选择了让玩家感到最“轻松”的那一种。玩家的战斗其实本质上就是选择合适的位置、在合适的时间对敌人造成伤害，并尽可能避免敌人对自己造成的伤害。 从空间上看，琪亚娜不论站在地图的任何位置，都可以对敌人造成伤害。以无脑按攻击键为例，combo的第1、4、5、6下带有明显的突进效果，即使离敌人很远也可以迅速拉近距离；combo的第2、3下带有枪击，可以使得无脑按键拉近距离的同时可以对远处的敌人造成伤害。 图25 远距离combo 更为关键的是，即便玩家在攻击时没有按下方向键，游戏系统会自动帮玩家锁定最近的敌人并调整角色朝向至面对该敌人。加上攻击动作的突进和远程攻击效果，这一设计实现了无脑按键即可清全图的效果。 图26 不按方向键系统自动调整锁定(注意画面左下的方向键) 从时间上看，玩家和敌人输出的时间各自占游戏时长的比例完全不在一个量级上。当玩家命中敌人时，敌人的攻击会被打断并产生明显的后仰来提示玩家。只要玩家持续攻击，敌人就持续无法反击，游戏一直处于玩家输出的状态，附带振屏与命中时的红光，手感可谓拳拳到肉。 图27 敌人受击后仰 反过来，当敌人攻击玩家时，对玩家能形成的干扰微乎其微。前文已经提到琪亚娜在出招时具有霸体，但其实角色移动时也附带霸体。 图28 移动霸体 总而言之，除非玩家在原地挂机，否则敌人的攻击就无法对玩家的操作输入产生任何影响（除了血量的减少）。这让人情不自禁想到了《三国无双》中被人称为“割草”的战斗系统——除了砍，就是砍！ 图29 原地受击 除了出招、奔跑、静止，剩下的操作就是回避。如果在战斗中琪亚娜成功回避敌人的攻击还可以触发长达3秒的“时空断裂”（期间场景变色），将敌人的动作放慢至几乎静止，任人宰割。触发的条件极为宽松，哪怕回避过程中“没有擦到敌人的攻击”，不可见的宽大碰撞体积也会帮助玩家进入。再考虑到前述的机制，可以说只要玩家在操作，敌人就没有办法阻止玩家的进攻。 图30 时空断裂离谱的宽松判定 小结一切的设计都是为了降低战斗的难度，一切的机制都是为了提升战斗的爽度，《崩坏3》早期关卡的战斗可以说把这两点做到了无可挑剔。 总结经过以上的分析，《崩坏3》的风格跃然纸上。从角色的运动特性上看，人物迅捷、快速且富有力量感，操作响应快，动作延时低；从战斗系统上看，战斗难度低，出招容易且效果强力，受击代价小，攻击成功反馈明显。这样的设计使得这款游戏确实做到了操作简单易上门、战斗爽快又刺激、演出华丽又炫酷。如果一款动作游戏能做到这样，不论其后续内容设计如何，起码这样的早期设计可以让动作游戏的苦手也能体验到游戏的魅力，吸引更多的潜在玩家，潜力极大。","categories":[{"name":"Game","slug":"Game","permalink":"http://example.com/categories/Game/"}],"tags":[{"name":"Game Design","slug":"Game-Design","permalink":"http://example.com/tags/Game-Design/"}]},{"title":"从设计角度看攻防一体动作对《怪物猎人》游戏体验的影响","slug":"mh_iframe_analysis","date":"2021-08-27T11:18:37.000Z","updated":"2021-10-19T15:44:22.459Z","comments":true,"path":"2021/08/27/mh_iframe_analysis/","link":"","permalink":"http://example.com/2021/08/27/mh_iframe_analysis/","excerpt":"概述《怪物猎人》（以下简称《怪猎》）是风靡世界的多人共斗狩猎动作游戏，第一作发售至今已经17年。游戏以挑战形形色色富有魅力的怪物为内容主体，给玩家带来紧张刺激的游戏体验。从系列作《怪猎X》开始，游戏引入了战斗风格系统，并将大量的无敌帧动作/类无敌帧动作放入了角色的动作系统中，在游戏操作变得更为复杂的同时，也扩大了玩家的操作空间。本文将这类动作称为“攻防一体动作”，并认为这一设计极大地提高了《怪猎》系列游戏的可玩性。接下来，本文将从攻防一体动作对游戏难度、游戏玩法、游戏寿命等三方面的积极影响来论证上述观点。（为简化分析，本文仅分析近战武器的动作系统）","text":"概述《怪物猎人》（以下简称《怪猎》）是风靡世界的多人共斗狩猎动作游戏，第一作发售至今已经17年。游戏以挑战形形色色富有魅力的怪物为内容主体，给玩家带来紧张刺激的游戏体验。从系列作《怪猎X》开始，游戏引入了战斗风格系统，并将大量的无敌帧动作/类无敌帧动作放入了角色的动作系统中，在游戏操作变得更为复杂的同时，也扩大了玩家的操作空间。本文将这类动作称为“攻防一体动作”，并认为这一设计极大地提高了《怪猎》系列游戏的可玩性。接下来，本文将从攻防一体动作对游戏难度、游戏玩法、游戏寿命等三方面的积极影响来论证上述观点。（为简化分析，本文仅分析近战武器的动作系统） 概念介绍立回格斗游戏中的术语，指对战双方在攻击对方成功或防御对方进攻之前所做的一切动作。其目的是使自己进入有利的情况，或者使对手陷入不利的情况。在怪猎语境下的“立回”，指的是与怪物对抗时类似回合制的打法思路，就是在怪物攻击间隔中设法进行反击的思想。 无敌帧即在游戏动画中玩家免受伤害的无敌时间。《怪猎》系列作品的回避翻滚动作向来包含无敌帧，因此熟练的玩家可以做出回避滚吼、回避滚甩尾等玩家“撞”过了怪物的动作却没有受到影响的操作。 背景介绍《怪猎》系列游戏融合了大量元素，包括战斗、养成、社交、探索等等，能给玩家带来多个方面的乐趣： 击败怪物的乐趣 装备外观的收集乐趣 角色数值成长的养成乐趣 生态环境的探索乐趣 与朋友/路人共斗的团队合作乐趣 2-5的所有要素均以1为基础，因此1能否持续给玩家带来稳定的正反馈非常重要。随着进度的推进，在游戏中玩家遭遇的怪物会越来越强：攻击力更高，动作更复杂/更难以躲避，外形也会更富有张力（更有BOSS感）。因此，1中的要素分为两方面：①玩家击败怪物的成就感②玩家与怪物互动的成就感 其中①易以理解，与传统的RPG游戏类似，玩家击败越来越强的怪物就像玩家完成更困难的关卡/任务，使玩家感受到自己在游戏中的成长。而②是本文要讨论的重点，即玩家在游戏中通过与怪物有来有回的战斗，感受到自身技术成长的成就感。 在早期的《怪猎》中，玩家只有1.对怪物进行输出，和2.走位/躲避怪物的攻击这两种状态。因此，玩家的大部分操作都集中1.攻击 2.立回，即在移动/回避类操作中寻找攻击的机会。玩家的水平也可以根据这两种操作的比例进行如下的划分： 初见/生疏。 花费大量时间在收刀奔跑/回避上，主要的移动路径为远离怪物与围绕怪物转圈，经常会受到怪物的攻击。只有在怪物出现较大空隙时才上前进行输出。 熟练。基本了解怪物的攻击盲区，可以通过精细的走位和回避同时完成躲避怪物的攻击与为下一阶段的输出做准备。 精通。完全了解怪物的出招规律，能通过移动引导怪物出招。可以利用无敌帧翻滚躲开许多原本需要花更长时间才能处理的危险情况，将输出的时间占比最大化。 随着玩家与怪物的战斗熟练度的提高，玩家可以将更多的时间投入到攻击中，减少立回的时间占总战斗时长的比例，从而提升击败怪物的速度。于是玩家战斗的过程可以简化为：躲避怪物的攻击并寻找机会进攻 &lt;-&gt; 攻击怪物。 对于大部分难以达到“高手”水平的玩家，并不能做到充分利用怪物攻击的盲区以维持和怪物和合理作战距离，因此玩家非常容易陷入绕着怪物转圈出招的“二人转”循环。 《怪猎》旧作无回性战斗逻辑 对于小体积的怪物来说，由于玩家无法进入怪物覆盖地表的内部，上述的立回逻辑容易使玩家陷入反复转圈的操作。对于大体积的怪物来说，虽然它们往往有针对玩家进入怪物视野盲区的招式（火龙的飞天接喷火、雷狼龙的转身拍击等）来强制玩家移动，最后仍容易让玩家陷入上述循环。在这样的设定下，虽然各种怪物的战斗逻辑看似大相径庭，但其实怪物的大部分招式都可以通过绕着怪物转圈这一解决方式来处理。 虽然高手可以用回避的无敌帧去“撞过”怪物的攻击，但这需要玩家经过大量的试错/学习（例如观看高手的无伤视频等），从而记住怪物特定招式的判定时长与回避无敌帧的长短关系，甚至是怪物攻击的狭小盲区。 在同类的游戏（《讨鬼传》、《噬神者》等）中，玩家缺少类似的机制，许多玩家往往会囿于这种转圈圈的作战方式。尽管这些作品怪物的设定丰富，但是战斗的乐趣在游戏后期显著较少。这也是《怪猎》系列可以长盛不衰的原因之一。 在《怪物猎人》系列中，没有那么多时间/精力去学习怪物判定与攻击盲区的玩家则容易分化成两类： 通过转圈这一千篇一律的方式打败BOSS 通过“回避性能”技能延长无敌帧持续时间，从而在操作不甚熟练的情况下接近高手的回避效率（满级回避性能可以几乎实现回避全程无敌，大大降低了游戏的难度）。 2的做法在网上的《怪猎》攻略中随处可见（见引用），因为“撞过”怪物攻击的瞬间的确能让人产生“自己是高手”的快感。但正如许多攻略所言，“回避性能”是一个“成瘾性”极强的技能。而游戏的设计又决定了普通水平的玩家不使用回避性能面对部分怪物时的挑战过于困难，因此它成为了一个玩家几乎“必出”且十分依赖的技能，极大地约束了玩家的出装自由。即使是长枪、铳枪这一类带有强防御性能的武器，也因为回避性能过于强悍而衍生出了回避打法。因为在历代怪猎后期，防御性能常常会跟不上怪物强度的变化，而长枪一类武器自带的回避硬直短距离小，与回避性能搭配后攻击间隙极小，因此玩家开发出了以回避为主要规避伤害手段的长枪、铳枪打法，统称“回枪”。 《怪猎》旧作有回性战斗逻辑 但从《怪猎X》、《怪猎XX》的风格动作系统引入攻防一体动作开始，这一情况得到了极大的改变。武士道风格的超长无敌帧回避附带回避后强化攻击、勇气风格的勇气收刀与大量GP判定（伤害免疫的防御判定）动作等等都属于这一类动作，它们增强了游戏的可玩性，并从游戏的玩法、难度、寿命等三个方面影响了这一款游戏。 对游戏体验的影响对玩法的影响在引入攻防一体动作以前，玩家与怪物的互动在逻辑上更像是回合制游戏。因为玩家无法在回避的同时进行攻击，即便是通过回避采取更好的走位以更好地为下次进攻做准备，在实质上也只是加快了回合制的回合轮换速度。 玩家的可选的动作池像是一个工具库。随着攻防一体类动作的加入，玩家在应对不同局面时的选择更多样化了。以太刀为例，在《怪物猎人・崛起》中的作战逻辑应该类似于下图，原本只能通过回避/走位解决的问题现在根据情况不同多了使用看破和居合斩这两种选项： 《怪猎崛起》太刀战斗逻辑 玩家在战斗时，需要考虑的内容变多（即图中红色的部分），不再简单地依赖于回避/走位，作战的复杂度和乐趣都增加了。因为攻防一体动作在回避怪物攻击的同时附带有进攻的效果，所以该设计会使玩家有强烈的倾向优先用这些动作去应对怪物的出招。 在XX中的武士道/勇气/空战风格可以看作世界和崛起中的攻防一体动作的前身。从这些带有特殊的攻防一体动作的风格比例数量证明这是玩家喜欢的设计方向。 对难度的影响从前文的图中就可以看出，引入攻防一体类动作后，短期来看游戏难度会更大，一方面是因为游戏的动作数量变多，玩家的出招序列变得复杂，学习负担加重了；另一方面因为攻防一体动作大多是高风险高回报的选项，学习的成本较一般的回避/走位更高（即更容易在游戏中死亡），但如果动作成功了，玩家可以得到丰富的反馈，因此这些动作在设计上往往对玩家操作时机的要求更高。例如大剑的铁山靠如果使用得当可以加快蓄力速度、太刀的居合斩在回避成功时可以造成大量伤害、充能斧的GP成功可以直接将出招序列快进到超级属性解放斩，但这些动作在使用时都会导致玩家在较长的时间内对角色的移动失去控制，如果使用不当反而容易被怪物击中。 但换一个角度看，如果玩家成长的空间只有对怪物动作的熟悉程度，即通过怪物的动作前兆来判断怪物的出招，与对应的走位的话，这种成长是非常有限的。因为玩家的处理手段单一，且应对怪物攻击最优的走位往是一条比较固定的狭小路线（例如在轰龙的左手前攻击可以避免被龙车击中、迅龙的腹下是转体回旋攻击的盲区），需要反复击杀怪物或者学习过往高手的经验才能获得。 而当游戏引入攻防一体动作后，玩家不需要像旧作中一样考虑怪物出招时带有攻击判定的空间具体如何，只需要考虑攻击“是否会命中自己”与“什么时候命中自己”，将玩家思考的问题重点从庞大的怪物转移到了玩家自身，极大地减轻了玩家的学习成本。另一方面，攻防一体动作的判定时长比回避的无敌帧要长很多，所以熟练掌握之后难度反而下降了。例如在旧作中的回避无敌帧在7帧左右（随着版本不同有少量的差异），即使使用最高级别的“回避性能”也只有12帧左右。而太刀的看破斩有20帧的无敌帧，充能斧的虫技变形前进有16帧的无敌帧，远大于回避翻滚的无敌帧数量。因此如果能熟练使用这类动作，玩家能有效躲避怪物攻击的成功率会大大上升，从游戏的长期来看，玩家在操作水平的成长性上会更好。 对寿命的影响因为怪物的动作并不是一个无穷集，游戏的难度设计只区分了下位、上位和G位三种难度。与RPG类游戏一般一只BOSS在游戏一周目内只会遇到一次不同，哪怕《怪猎》玩家选择只通关主线，大部分怪物的出现次数也不止一次。这样的设计决定了玩家在上位与G位遇到大多数怪物时的对应战斗经验不是零。在旧作中，玩家与怪物战斗的重点大部分在于怪物本身的动作，不同武器间的战斗思路大同小异（即“攻击 &lt;–&gt; 回避”的二元循环），尽管随着游戏进度的推进与任务等级的上升，怪物的动作会有增添，但是与玩家初见怪物时要消化的信息量相比可以说微乎其微。这些信息不会随着玩家换一种武器有任何的变化，因此当用一种类型的武器熟练狩猎某种怪物之后，更换武器战斗能获得的体验并没有办法带给玩家大量的新鲜感。 在引入攻防一体动作后，玩家的行动模式泛化性变差。尽管怪物的动作没有任何变化，但是不同武器应对怪物同一种攻击的手段不再局限于走位和时机把控，而是根据武器的特色产生完全不同的作战思路。例如《怪猎XX》中的勇气太刀需要尽可能通过GP判定动作“强行接下”怪物的所有攻击来最大化输出，作战的重点在于如果让怪物“打中”自己；而空战大剑则是找到每一个可以腾空的瞬间进行空中蓄力，作战的重点在于利用怪物的攻击前后摇。通过这样的设计改变，各种武器的动作系统开始产生极大的分化，让玩家在不同的武器下有全然不同的游戏体验，大大增加了玩家通关后更换武器重新狩猎的可能性，延长了游戏的寿命。 总结总的来说，攻防一体动作的引入使得《怪猎》做出了共斗类游戏中独树一帜的风格，让玩家可以打得更“爽”、战得更“嗨”，更容易在紧张刺激的氛围中体验狩猎的乐趣。通过引入这一设计，游戏的玩法更有趣了，游戏的难度曲线更合理了，游戏的寿命也延长了，是同类游戏可以参考的动作设计典范。 引用（关于回避性能的推荐帖） https://xn--gdkl0dubtwb7e3008dk17a.com/?p=47449 《怪物猎人崛起》 http://blog.livedoor.jp/gamer_momochan/archives/5542409.html 《怪物猎人世界冰原》 https://ngabbs.com/read.php?tid=19574685&amp;rand=638 《怪物猎人世界》 https://www.gamersky.com/handbook/201809/1102987_3.shtml 《怪物猎人世界》 https://bassy-mh.info/skill-kaihiseinou.html 《怪物猎人X》 https://detail.chiebukuro.yahoo.co.jp/qa/question_detail/q14143697614 《怪物猎人4G》 http://mhs.blog.jp/1011184536 《怪物猎人4》 https://w.atwiki.jp/mh3wii/pages/384.html 《怪物猎人3》","categories":[{"name":"Game","slug":"Game","permalink":"http://example.com/categories/Game/"}],"tags":[{"name":"Note","slug":"Note","permalink":"http://example.com/tags/Note/"},{"name":"Game Design","slug":"Game-Design","permalink":"http://example.com/tags/Game-Design/"}]}],"categories":[{"name":"Game","slug":"Game","permalink":"http://example.com/categories/Game/"}],"tags":[{"name":"Game Design","slug":"Game-Design","permalink":"http://example.com/tags/Game-Design/"},{"name":"Note","slug":"Note","permalink":"http://example.com/tags/Note/"}]}